[
    {
      "id": "01",
      "companyName": "Google",
      "jobTitle": "Web Developer",
      "jobDescription": " As a Web Developer at Google, you will be responsible for developing web applications that meet the needs of Google's users. Your primary responsibilities will include designing and implementing user interfaces, writing server-side code, and integrating with various Google services and APIs. You will work closely with cross-functional teams including product managers, designers, and software engineers to develop and launch new web applications and features. Additionally, you will be expected to write clean, maintainable, and well-documented code following industry best practices for coding, testing, and debugging.",
      "jobResponsibility": " The primary responsibility will be to develop web applications that meet the needs of Google's users. This will involve designing and implementing user interfaces, writing server-side code, and integrating with various Google services and APIs. Besides that you will work closely with other teams within Google, including product managers, designers, and software engineers, to develop and launch new web applications and features. You will need to communicate effectively with these teams to understand their requirements and ensure that your code meets their needs.",
      "educationalRequirement": "i. Bachelor's or Master's degree in Computer Science or related field. ii. Excellent problem-solving and analytical skills. iii. Strong programming skills in one or more of the following languages: JavaScript, Python, Java, or C++.  iv.Strong communication and collaboration skills.",
      "experience": "1-2 years in web development field.",
      "salary": "80K-95K", 
      "jobType": "Onsite", 
      "workingType": "Full Time", 
      "phone": "01300125893",
      "email": "job.info@google.com",
      "address": "Road No. 2, Dhanmondi, Dhaka, Bangladesh ",
      "bgImage": "https://images.unsplash.com/photo-1573804633927-bfcbcd909acd?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1227&q=80"
    },
    {
      "id": "02",
      "companyName": "Facebook",
      "jobTitle": "Frontend Developer",
      "jobDescription": " As a Frontend Developer at Facebook, you will be responsible for building and implementing user interfaces for our web and mobile applications. You will work closely with product managers, designers, and software engineers to develop and launch new features that improve the user experience. You will need to be comfortable working with modern front-end technologies and frameworks and have a strong understanding of web development best practices.",
      "jobResponsibility": " Develop and implement user interfaces for web and mobile applications using modern front-end technologies and frameworks. Collaborate with product managers, designers, and software engineers to develop and launch new features. Write clean, well-documented, and maintainable code that follows industry best practices for coding, testing, and debugging. Provide technical guidance and mentorship to other team members and contribute to open source projects.",
      "educationalRequirement": "i. Bachelor or Master degree  in computer science, information science, or similar. ii. Familiarity with front-end build tools and preprocessors such as webpack, gulp, or Sass. iii. Excellent problem-solving and analytical skills.",
      "experience": "2-3 years in this field. Experience with mobile development and cross-platform frameworks such as React Native or Flutter is a plus.",
      "salary": "90K-110K", 
      "jobType": "Onsite", 
      "workingType": "Full Time", 
      "phone": "01500012123",
      "email": "job.info@facebook.com",
      "address": "Road No. 5, Mirpur, Dhaka, Bangladesh ",
      "bgImage": "https://images.unsplash.com/photo-1636114673156-052a83459fc1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80"
    },
    {
      "id": "03",
      "companyName": "Microsoft",
      "jobTitle": "Web Developer",
      "jobDescription": " As a Web Developer at Microsoft, you will be responsible for developing web applications that meet the needs of Google's users. Your primary responsibilities will include designing and implementing user interfaces, writing server-side code, and integrating with various Google services and APIs. You will work closely with cross-functional teams including product managers, designers, and software engineers to develop and launch new web applications and features. Additionally, you will be expected to write clean, maintainable, and well-documented code following industry best practices for coding, testing, and debugging.",
      "jobResponsibility": " The primary responsibility will be to develop web applications that meet the needs of Microsoft users. This will involve designing and implementing user interfaces, writing server-side code, and integrating with various Microsoft services and APIs. Besides that you will work closely with other teams within Microsoft, including product managers, designers, and software engineers, to develop and launch new web applications and features. You will need to communicate effectively with these teams to understand their requirements and ensure that your code meets their needs.",
      "educationalRequirement": "Bachelor or Master degree to complete any reputation university. Excellent problem-solving and analytical skills.",
      "experience": "1-2 years in Web Development field.",
      "salary": "70K-80K", 
      "jobType": "Onsite", 
      "workingType": "Full Time", 
      "phone": "01012345678",
      "email": "job.info@microsoft.com",
      "address": "Road No. 1, Shantinagar, Dhaka, Bangladesh ",
      "bgImage": "https://images.unsplash.com/photo-1662947036583-d67dd8055edf?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1228&q=80"
    },
    {
      "id": "04",
      "companyName": "Netflix",
      "jobTitle": "Junior Product Designer",
      "jobDescription": " As a Junior Product Designer at Netflix, you will be part of the team responsible for designing and delivering world-class user experiences for our web and mobile applications. You will work alongside senior designers, product managers, and engineers to create innovative and engaging products that delight our customers. You will need to have a strong understanding of user-centered design principles and be comfortable working in a fast-paced and dynamic environment.",
      "jobResponsibility": "Work with senior designers to create and iterate on wireframes, user flows, and prototypes for web and mobile applications. Collaborate with product managers and engineers to ensure that designs are feasible and aligned with the product vision and besides help to develop and maintain design systems and pattern libraries to ensure consistency and scalability across products. ",
      "educationalRequirement": "Bachelor's or Master's degree in Design, Human-Computer Interaction, or related field from any reputation university.",
      "experience": "1 years in this field. Strong proficiency in design tools such as Sketch, Figma, or Adobe Creative Suite. Excellent visual and communication design skills, with a strong portfolio demonstrating user-centered design thinking",
      "salary": "75K-85K", 
      "jobType": "Onsite", 
      "workingType": "Full Time", 
      "phone": "01001567812",
      "email": "job.info@netflix.com",
      "address": "Road No. 5, Bashundhara, Dhaka, Bangladesh",
      "bgImage": "https://images.unsplash.com/photo-1522869635100-9f4c5e86aa37?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80"
    },
    {
      "id": "05",
      "companyName": "Instagram",
      "jobTitle": "Software Engineer",
      "jobDescription": " As a Software Engineer at Instagram, you will be responsible for building and maintaining scalable and reliable systems that power one of the world's largest social media platforms. You will work alongside a team of engineers, product managers, and designers to deliver new features and improve the user experience. You will need to have a strong understanding of software engineering principles and be comfortable working with large-scale distributed systems.",
      "jobResponsibility": " Design, develop, and maintain software systems and infrastructure that power Instagram's web and mobile applications. Collaborate with cross-functional teams to define product requirements and develop technical solutions that meet business needs. Write clean, well-documented, and maintainable code that follows industry best practices for coding, testing, and debugging. Participate in code reviews and provide feedback to other team members. Monitor and troubleshoot production systems to ensure uptime and reliability.",
      "educationalRequirement": "Bachelor's or Master's degree in Computer Science or related field from any reputation university. Strong understanding of software engineering principles, design patterns, and best practices.",
      "experience": "1-2 years in software development field.",
      "salary": "80K-115K", 
      "jobType": "Onsite", 
      "workingType": "Full Time", 
      "phone": "01123456789",
      "email": "jon.info@instagram.com",
      "address": "Road No. 5, Bashundhara, Dhaka, Bangladesh ",
      "bgImage": "https://images.unsplash.com/photo-1611262588024-d12430b98920?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1074&q=80"
    },
    {
      "id": "06",
      "companyName": "Twitter",
      "jobTitle": "Software Engineer",
      "jobDescription": "As a Software Engineer at Twitter, you will be responsible for building and maintaining scalable and reliable systems that power one of the world's largest social media platforms. You will work alongside a team of engineers, product managers, and designers to deliver new features and improve the user experience. You will need to have a strong understanding of software engineering principles and be comfortable working with large-scale distributed systems.",
      "jobResponsibility": "Design, develop, and maintain software systems and infrastructure that power Instagram's web and mobile applications. Collaborate with cross-functional teams to define product requirements and develop technical solutions that meet business needs. Write clean, well-documented, and maintainable code that follows industry best practices for coding, testing, and debugging. Participate in code reviews and provide feedback to other team members. Monitor and troubleshoot production systems to ensure uptime and reliability.",
      "educationalRequirement": "Bachelor's or Master's degree in Computer Science or related field from any reputation university. Strong understanding of software engineering principles, design patterns, and best practices.",
      "experience": "1-2 years in the software development field.",
      "salary": "80K-90K", 
      "jobType": "Onsite", 
      "workingType": "Full Time", 
      "phone": "01012345678",
      "email": "job.info@twitter.com",
      "address": "Road No. 4, Tejgao, Dhaka, Bangladesh",
      "bgImage": "https://images.unsplash.com/photo-1611605698335-8b1569810432?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1074&q=80"
    }
    
  ]
  